# Area2Str

## Description
Convert an area value (in square millimeters) from a real number to a string using the current document formatting.

```pascal
FUNCTION Area2Str(value : REAL): STRING;
```

```python
def vs.Area2Str(value):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|value|REAL|The area value in square millimeters|

## Version
Availability: from Vectorworks 2014

## Category
* Strings